batchsize_experiment/log/gpu_0.95_ttft_5000_tpot_50/client_batchsize280_20251112_043652.log
/root/miniconda3/envs/openrlhf/lib/python3.10/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 11-12 04:36:57 [__init__.py:216] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8011', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, no_stream=False, max_concurrency=280, model='/root/.cache/huggingface/hub/Qwen2.5-7B-Instruct', tokenizer=None, use_beam_search=False, num_prompts=280, logprobs=None, request_rate=inf, burstiness=1.0, seed=42, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=['ttft:5000', 'tpot:50'], custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=512, random_output_len=1024, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=0.8, top_k=20, min_p=None, temperature=0.7, repetition_penalty=1.05, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, load_input_requests=None, save_input_requests=True)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf RPS.
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 280
100%|██████████| 280/280 [00:51<00:00,  5.39it/s]
============ Serving Benchmark Result ============
Successful requests:                     280       
Benchmark duration (s):                  51.96     
Total input tokens:                      143131    
Total generated tokens:                  286720    
Min_input_len:                           457.0     
Max_input_len:                           512.0     
Mean_input_len:                          511.1821428571429
P50_input_len:                           512.0     
P99_input_len:                           512.0     
Min_output_len:                          1024.0    
Max_output_len:                          1024.0    
Mean_output_len:                         1024.0    
P50_output_len:                          1024.0    
P99_output_len:                          1024.0    
Request throughput (req/s):              5.39      
Request goodput (req/s):                 4.33      
Output token goodput (tok/s):            4434.29   
Total token goodput (tok/s):             6648.75   
Output token throughput (tok/s):         5518.23   
Total Token throughput (tok/s):          8272.94   
---------------Time to First Token----------------
Mean TTFT (ms):                          1164.73   
Median TTFT (ms):                        774.01    
P99 TTFT (ms):                           1634.02   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          49.58     
Median TPOT (ms):                        49.96     
P99 TPOT (ms):                           50.05     
---------------Inter-token Latency----------------
Mean ITL (ms):                           49.58     
Median ITL (ms):                         49.20     
P99 ITL (ms):                            58.54     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          51887.00  
Median E2EL (ms):                        51897.28  
P99 E2EL (ms):                           51918.83  
==================================================